pgn-reader/docs/visitor.dot
digraph G {
    splines=line;
    S, E [shape=point];

    S -> begin_tags -> tag;
    tag [shape=record,label="tag"];
    tag -> tag -> begin_movetext;

    begin_movetext -> end_game [label="Skip(true)",style=dotted];
    begin_movetext -> moves [label="Skip(false)"];

    moves [shape=record,label="san|nag|comment|outcome|<beginvar>begin_variation"];
    subvariation [shape=record];
    moves:beginvar -> subvariation [label="Skip(false)"];
    end_variation [shape=record];
    subvariation -> end_variation;
    moves:beginvar -> end_variation [label="Skip(true)",style=dotted];
    moves:beginvar -> end_game [label="Skip(true)",style=dotted];
    moves -> moves;

    moves -> end_game -> E;
}
